app/Controllers/Payment_controller.php

SELECT *
FROM `users`
---
    public function index()
    {
        $data['users'] = $this->Auth_model->findAll();