app/Models/Mahasiswa_model.php

SELECT *
FROM `mahasiswa`
JOIN `semester` ON `mahasiswa`.`id_semester` = `semester`.`id_semester`
JOIN `users` ON `mahasiswa`.`nim` = `users`.`nim`
ORDER BY `mahasiswa`.`nim` ASC
---
    public function list_mahasiswa()
    {
        return $this->db->table('mahasiswa')
                    ->join('semester', 'mahasiswa.id_semester = semester.id_semester')
                    ->join('users', 'mahasiswa.nim = users.nim')
                    ->orderBy('mahasiswa.nim', 'asc')
                    ->get();

SELECT *
FROM `semester`
ORDER BY `semester` ASC
---
    public function list_semester()
    {
        return $this->db->table('semester')->orderBy('semester', 'ASC')->get();

SELECT *
FROM `tahun_ajaran`
ORDER BY `tahun_ajaran`
---
    public function tahun_ajar()
    {
        return $this->db->table('tahun_ajaran')->orderBy('tahun_ajaran')->get();