app/Models/Tahun_ajaran_model.php

    public function edit_page_tahun($id)
    {
        return $this->db->table($this->table)->where('id', $id)->get()->getResult(); // Menggunakan getResult() untuk mengembalikan array objek
---
SELECT *
FROM `tahun_ajaran`
WHERE `id` = '9'

    public function delete_tahun($data)
    {
        $this->db->table('tahun_ajaran')->where('id', $data['id'])->delete($data);
---
DELETE FROM `tahun_ajaran`
WHERE `id` = '$1'
AND `id` = '$1'

    public function edit_post($id, $data)
    {
        $this->db->table($this->table)
                 ->where('id', $id)
                 ->update($data);
---
UPDATE `tahun_ajaran` SET `tahun_ajaran` = '2026/2027', `status_tahun_ajar` = 'Aktif'
WHERE `id` = '9'